deviTangt/STM32H743Code_Backup/STI_exercise/备份/STI-19D - 副本/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define AD9959_P3_Pin GPIO_PIN_2
#define AD9959_P3_GPIO_Port GPIOE
#define AD9959_SD1_Pin GPIO_PIN_3
#define AD9959_SD1_GPIO_Port GPIOE
#define AD9959_SD2_Pin GPIO_PIN_4
#define AD9959_SD2_GPIO_Port GPIOE
#define AD9959_SD3_Pin GPIO_PIN_5
#define AD9959_SD3_GPIO_Port GPIOE
#define FPGA_MISO_Pin GPIO_PIN_2
#define FPGA_MISO_GPIO_Port GPIOC
#define FPGA_MOSI_Pin GPIO_PIN_3
#define FPGA_MOSI_GPIO_Port GPIOC
#define AD9959_SD0_Pin GPIO_PIN_1
#define AD9959_SD0_GPIO_Port GPIOA
#define AD9959_SCK_Pin GPIO_PIN_3
#define AD9959_SCK_GPIO_Port GPIOA
#define AD9959_IUP_Pin GPIO_PIN_4
#define AD9959_IUP_GPIO_Port GPIOA
#define AD9959_CSB_Pin GPIO_PIN_5
#define AD9959_CSB_GPIO_Port GPIOA
#define FPGA_CS_Pin GPIO_PIN_15
#define FPGA_CS_GPIO_Port GPIOE
#define FPGA_SCL_Pin GPIO_PIN_10
#define FPGA_SCL_GPIO_Port GPIOB
#define AD9959_RST_Pin GPIO_PIN_11
#define AD9959_RST_GPIO_Port GPIOB
#define TJC_TX_Pin GPIO_PIN_14
#define TJC_TX_GPIO_Port GPIOB
#define TJC_RX_Pin GPIO_PIN_15
#define TJC_RX_GPIO_Port GPIOB
#define LCD_BL_Pin GPIO_PIN_15
#define LCD_BL_GPIO_Port GPIOD
#define LCD_DC_Pin GPIO_PIN_6
#define LCD_DC_GPIO_Port GPIOD
#define LCD_RES_Pin GPIO_PIN_7
#define LCD_RES_GPIO_Port GPIOD
#define LCD_SCL_Pin GPIO_PIN_3
#define LCD_SCL_GPIO_Port GPIOB
#define LCD_SDA_Pin GPIO_PIN_5
#define LCD_SDA_GPIO_Port GPIOB
#define AD9959_P0_Pin GPIO_PIN_6
#define AD9959_P0_GPIO_Port GPIOB
#define AD9959_P1_Pin GPIO_PIN_8
#define AD9959_P1_GPIO_Port GPIOB
#define AD9959_P2_Pin GPIO_PIN_0
#define AD9959_P2_GPIO_Port GPIOE
#define AD9959_PDC_Pin GPIO_PIN_1
#define AD9959_PDC_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
